#SingleInstance force


;;; ┌─────────────────┐
;;; │  Special chars  │
;;; └─────────────────┘

:*?:````::´

:*?:``euro::€
:*?:``pound::£
:*?:``cent::¢

:*?:``thorn::þ
:*?:``eth::ð
:*?:``ss::ß

:*?:``section::§
:*?:``para::¶

:*?:``copy::©
:*?:``reg::®
:*?:``tm::™

:*?:``+-::±

:*?:``^a::ª
:*?:``^0::º
:*?:``^1::¹
:*?:``^2::²
:*?:``^3::³
:*?:``^n::ⁿ
:*?:``^1/4::¼
:*?:``^1/2::½
:*?:``^3/4::¾

:*?:``square::□
:*?:``diamond::◊
:*?:``circle::◦

:*?:``ellips::…

:*?:``--::―
:*?:``|::¦

:*?:``deg::°

:*?:``%o::‰

:*C0?:``dagger::†
:*C0?:``DAGGER::‡

:*?:``music::♪

:*?:``o/::ø

:*?:``?::¿
:*?:``!::¡

:*?:``<<::«
:*?:``>>::»

:*?:``box1::─
:*?:``box2::┐
:*?:``box3::│
:*?:``box4::┘
:*?:``box5::└
:*?:``box6::┌

;;; ┌─────────────────────┐
;;; │  Accentuated chars  │
;;; └─────────────────────┘

:*?:``e'::é
:*?:``e``::è
:*?:``e;::ë
:*?:``e6::ê
:*?:``e-::ē

:*?:``a'::á
:*?:``a``::à
:*?:``a;::ä
:*?:``a6::â
:*?:``a-::ā
:*?:``a~::ã

:*?:``o'::ó
:*?:``o``::ò
:*?:``o;::ö
:*?:``o6::ô
:*?:``o-::ō
:*?:``o~::õ

:*?:``u'::ú
:*?:``u``::ù
:*?:``u;::ü
:*?:``u6::û
:*?:``u-::ū
:*?:``u~::ũ

:*?:``i'::í
:*?:``i``::ì
:*?:``i;::ï
:*?:``i6::î
:*?:``i-::ī
:*?:``i~::ĩ

:*?:``y;::ÿ

:*?:``n~::ñ

:*?:``ae::æ
:*?:``oe::œ

:*?:``c,::ç

;;; ┌──────────────┐
;;; │  Math chars  │
;;; └──────────────┘

:*?:``*::×
:*?:``:-::÷
:*?:``.::·
:*?:``dif::∂
:*?:``sum::∑
:*?:``prod::∏
:*?:``inf::∞
:*?:``int::∫
:*?:``=~::≈
:*?:``=/::≠
:*?:``>=::≥
:*?:``<=::≤

;;; ┌─────────────────┐
;;; │  Greek symbols  │
;;; └─────────────────┘

:*?:``alpha::α
:*?:``beta::ß
:*?:``gamma::γ
:*?:``delta::δ
:*?:``epsilon::ε
:*?:``zeta::ζ
:*?:``eta::η
:*?:``theta::θ
:*?:``iota::ι
:*?:``kappa::κ
:*?:``lambda::λ
:*?:``mu::µ
:*?:``nu::ν
:*?:``xi::ξ
:*?:``omicron::ο
:*?:``pi::π
:*?:``rho::ρ
:*?:``sigma::σ
:*?:``tau::τ
:*?:``upsilon::υ
:*?:``phi::φ
:*?:``chi::χ
:*?:``psi::ψ
:*?:``omega::ω

;;; ┌─────────────────┐
;;; │  Japanese kana  │
;;; └─────────────────┘

:c*?:~a::あ
:c*?:~i::い
:c*?:~u::う
:c*?:~e::え
:c*?:~o::お
:c*?:~ka::か
:c*?:~ki::き
:c*?:~ku::く
:c*?:~ke::け
:c*?:~ko::こ
:c*?:~sa::さ
:c*?:~shi::し
:c*?:~su::す
:c*?:~se::せ
:c*?:~so::そ
:c*?:~ta::た
:c*?:~chi::ち
:c*?:~tsu::つ
:c*?:~te::て
:c*?:~to::と
:c*?:~na::な
:c*?:~ni::に
:c*?:~nu::ぬ
:c*?:~ne::ね
:c*?:~no::の
:c*?:~ha::は
:c*?:~hi::ひ
:c*?:~fu::ふ
:c*?:~he::へ
:c*?:~ho::ほ
:c*?:~ma::ま
:c*?:~mi::み
:c*?:~mu::む
:c*?:~me::め
:c*?:~mo::も
:c*?:~ya::や
:c*?:~yu::ゆ
:c*?:~yo::よ
:c*?:~ra::ら
:c*?:~ri::り
:c*?:~ru::る
:c*?:~re::れ
:c*?:~ro::ろ
:c*?:~wa::わ
:c*?:~wo::を

:c*?:~ga::が
:c*?:~gi::ぎ
:c*?:~gu::ぐ
:c*?:~ge::げ
:c*?:~go::ご
:c*?:~za::ざ
:c*?:~ji::じ
:c*?:~zu::ず
:c*?:~ze::ぜ
:c*?:~zo::ぞ
:c*?:~da::だ
:c*?:~dzi::ぢ
:c*?:~dzu::づ
:c*?:~de::で
:c*?:~do::ど
:c*?:~ba::ば
:c*?:~bi::び
:c*?:~bu::ぶ
:c*?:~be::べ
:c*?:~bo::ぼ
:c*?:~pa::ぱ
:c*?:~pi::ぴ
:c*?:~pu::ぷ
:c*?:~pe::ぺ
:c*?:~po::ぽ

:c*?:-tsu::っ
:c*?:~-ya::ゃ
:c*?:~-yu::ゅ
:c*?:~-yo::ょ
:c*?:~kya::きゃ
:c*?:~kyu::きゅ
:C*?:~kyo::きょ
:c*?:~gya::ぎゃ
:c*?:~gyu::ぎゅ
:c*?:~gyo::ぎょ
:c*?:~shya::しゃ
:c*?:~shyu::しゅ
:c*?:~shyo::しょ
:c*?:~sha::しゃ
:c*?:~shu::しゅ
:c*?:~sho::しょ
:c*?:~jya::じゃ
:c*?:~jyu::じゅ
:c*?:~jyo::じょ
:c*?:~ja::じゃ
:c*?:~ju::じゅ
:c*?:~jo::じょ
:c*?:~tya::ちゃ
:c*?:~tyu::ちゅ
:c*?:~tyo::ちょ
:c*?:~cha::ちゃ
:c*?:~chu::ちゅ
:c*?:~cho::ちょ
:c*?:~chya::ちゃ
:c*?:~chyu::ちゅ
:c*?:~chyo::ちょ
:c*?:~dya::ぢゃ
:c*?:~dyu::ぢゅ
:c*?:~dyo::ぢょ
:c*?:~nya::にゃ
:c*?:~nyu::にゅ
:c*?:~nyo::にょ
:c*?:~hya::ひゃ
:c*?:~hyu::ひゅ
:c*?:~hyo::ひょ
:c*?:~bya::びゃ
:c*?:~byu::びゅ
:c*?:~byo::びょ
:c*?:~pya::ぴゃ
:c*?:~pyu::ぴゅ
:c*?:~pyo::ぴょ
:c*?:~mya::みゃ
:c*?:~myu::みゅ
:c*?:~myo::みょ
:c*?:~rya::りゃ
:c*?:~ryu::りゅ
:c*?:~ryo::りょ

:c*?:~en::ん
:c*?:~nn::ん


:c*?:~A::ア
:c*?:~I::イ
:c*?:~U::ウ
:c*?:~E::エ
:c*?:~O::オ
:c*?:~Ka::カ
:c*?:~KA::カ
:c*?:~Ki::キ
:c*?:~KI::キ
:c*?:~Ku::ク
:c*?:~KU::ク
:c*?:~Ke::ケ
:c*?:~KE::ケ
:c*?:~Ko::コ
:c*?:~KO::コ
:c*?:~Sa::サ
:c*?:~SA::サ
:c*?:~Shi::シ
:c*?:~SHI::シ
:c*?:~Su::ス
:c*?:~SU::ス
:c*?:~Se::セ
:c*?:~SE::セ
:c*?:~So::ソ
:c*?:~SO::ソ
:c*?:~Ta::タ
:c*?:~TA::タ
:c*?:~Chi::チ
:c*?:~CHI::チ
:c*?:~Tsu::ツ
:c*?:~TSU::ツ
:c*?:~Te::テ
:c*?:~TE::テ
:c*?:~To::ト
:c*?:~TO::ト
:c*?:~Na::ナ
:c*?:~NA::ナ
:c*?:~Ni::ニ
:c*?:~NI::ニ
:c*?:~Nu::ヌ
:c*?:~NU::ヌ
:c*?:~Ne::ネ
:c*?:~NE::ネ
:c*?:~No::ノ
:c*?:~NO::ノ
:c*?:~Ha::ハ
:c*?:~HA::ハ
:c*?:~Hi::ヒ
:c*?:~HI::ヒ
:c*?:~Fu::フ
:c*?:~FU::フ
:c*?:~He::ヘ
:c*?:~HE::ヘ
:c*?:~Ho::ホ
:c*?:~HO::ホ
:c*?:~Ma::マ
:c*?:~MA::マ
:c*?:~Mi::ミ
:c*?:~MI::ミ
:c*?:~Mu::ム
:c*?:~MU::ム
:c*?:~Me::メ
:c*?:~ME::メ
:c*?:~Mo::モ
:c*?:~MO::モ
:c*?:~Ya::ヤ
:c*?:~YA::ヤ
:c*?:~Yu::ユ
:c*?:~YU::ユ
:c*?:~Yo::ヨ
:c*?:~YO::ヨ
:c*?:~Ra::ラ
:c*?:~RA::ラ
:c*?:~Ri::リ
:c*?:~RI::リ
:c*?:~Ru::ル
:c*?:~RU::ル
:c*?:~Re::レ
:c*?:~RE::レ
:c*?:~Ro::ロ
:c*?:~RO::ロ
:c*?:~Wa::ワ
:c*?:~WA::ワ
:c*?:~Wo::ヲ
:c*?:~WO::ヲ

:c*?:~Ga::ガ
:c*?:~GA::ガ
:c*?:~Gi::ギ
:c*?:~GI::ギ
:c*?:~Gu::グ
:c*?:~GU::グ
:c*?:~Ge::ゲ
:c*?:~GE::ゲ
:c*?:~Go::ゴ
:c*?:~GO::ゴ
:c*?:~Za::ザ
:c*?:~ZA::ザ
:c*?:~Ji::ジ
:c*?:~JI::ジ
:c*?:~Zu::ズ
:c*?:~ZU::ズ
:c*?:~Ze::ゼ
:c*?:~ZE::ゼ
:c*?:~Zo::ゾ
:c*?:~ZO::ゾ
:c*?:~Da::ダ
:c*?:~DA::ダ
:c*?:~Dzi::ヂ
:c*?:~DZI::ヂ
:c*?:~Dzu::ヅ
:c*?:~DZU::ヅ
:c*?:~De::デ
:c*?:~DE::デ
:c*?:~Do::ド
:c*?:~DO::ド
:c*?:~Ba::バ
:c*?:~BA::バ
:c*?:~Bi::ビ
:c*?:~BI::ビ
:c*?:~Bu::ブ
:c*?:~BU::ブ
:c*?:~Be::ベ
:c*?:~BE::ベ
:c*?:~Bo::ボ
:c*?:~BO::ボ
:c*?:~Pa::パ
:c*?:~PA::パ
:c*?:~Pi::ピ
:c*?:~PI::ピ
:c*?:~Pu::プ
:c*?:~PU::プ
:c*?:~Pe::ペ
:c*?:~PE::ペ
:c*?:~Po::ポ
:c*?:~PO::ポ

:c*?:-Tsu::ッ
:c*?:-TSU::ッ
:c*?:~-Ya::ャ
:c*?:~-YA::ャ
:c*?:~-Yu::ュ
:c*?:~-YU::ュ
:c*?:~-Yo::ョ
:c*?:~-YO::ョ

:c*?:~Kya::キャ
:c*?:~KYA::キャ
:c*?:~Kyu::キュ
:c*?:~KYU::キュ
:C*?:~Kyo::キョ
:C*?:~KYO::キョ
:c*?:~Gya::ギャ
:c*?:~GYA::ギャ
:c*?:~Gyu::ギュ
:c*?:~GYU::ギュ
:c*?:~Gyo::ギョ
:c*?:~GYO::ギョ
:c*?:~Shya::シャ
:c*?:~SHYA::シャ
:c*?:~Shyu::シュ
:c*?:~SHYU::シュ
:c*?:~Shyo::ショ
:c*?:~SHYO::ショ
:c*?:~Sha::シャ
:c*?:~SHA::シャ
:c*?:~Shu::シュ
:c*?:~SHU::シュ
:c*?:~Sho::ショ
:c*?:~SHO::ショ
:c*?:~Jya::ジャ
:c*?:~JYA::ジャ
:c*?:~Jyu::ジュ
:c*?:~JYU::ジュ
:c*?:~Jyo::ジョ
:c*?:~JYO::ジョ
:c*?:~Ja::ジャ
:c*?:~JA::ジャ
:c*?:~Ju::ジュ
:c*?:~JU::ジュ
:c*?:~Jo::ジョ
:c*?:~JO::ジョ
:c*?:~Tya::チャ
:c*?:~TYA::チャ
:c*?:~Tyu::チュ
:c*?:~TYU::チュ
:c*?:~Tyo::チョ
:c*?:~TYO::チョ
:c*?:~Cha::チャ
:c*?:~CHA::チャ
:c*?:~Chu::チュ
:c*?:~CHU::チュ
:c*?:~Cho::チョ
:c*?:~CHO::チョ
:c*?:~Chya::チャ
:c*?:~CHYA::チャ
:c*?:~Chyu::チュ
:c*?:~CHYU::チュ
:c*?:~Chyo::チョ
:c*?:~CHYO::チョ
:c*?:~Dya::ヂャ
:c*?:~DYA::ヂャ
:c*?:~Dyu::ヂュ
:c*?:~DYU::ヂュ
:c*?:~Dyo::ヂョ
:c*?:~DYO::ヂョ
:c*?:~Nya::ニャ
:c*?:~NYA::ニャ
:c*?:~Nyu::ニュ
:c*?:~NYU::ニュ
:c*?:~Nyo::ニョ
:c*?:~NYO::ニョ
:c*?:~Hya::ヒャ
:c*?:~HYA::ヒャ
:c*?:~Hyu::ヒュ
:c*?:~HYU::ヒュ
:c*?:~Hyo::ヒョ
:c*?:~HYO::ヒョ
:c*?:~Bya::ビャ
:c*?:~BYA::ビャ
:c*?:~Byu::ビュ
:c*?:~BYU::ビュ
:c*?:~Byo::ビョ
:c*?:~BYO::ビョ
:c*?:~Pya::ピャ
:c*?:~PYA::ピャ
:c*?:~Pyu::ピュ
:c*?:~PYU::ピュ
:c*?:~Pyo::ピョ
:c*?:~PYO::ピョ
:c*?:~Mya::ミャ
:c*?:~MYA::ミャ
:c*?:~Myu::ミュ
:c*?:~MYU::ミュ
:c*?:~Myo::ミョ
:c*?:~MYO::ミョ
:c*?:~Rya::リャ
:c*?:~RYA::リャ
:c*?:~Ryu::リュ
:c*?:~RYU::リュ
:c*?:~Ryo::リョ
:c*?:~RYO::リョ

:c*?:~En::ン
:c*?:~EN::ン
:c*?:~Nn::ン
:c*?:~NN::ン

:*?:~.::。
:*?:~,::、


;;; ┌────────────────┐
;;; │   Key Remaps   │
;;; └────────────────┘
;;;#Backspace::Delete
RAlt::APPSKEY
RWin::Home


;;; ┌─────────────────┐
;;; │  Mouse Remaps   │
;;; └─────────────────┘
;;;

